perf/tests/endpoints/rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - arrivalRate: 1
      duration: 20
    - arrivalRate: 2
      duration: 30
    - arrivalRate: 3
      duration: 40

scenarios:
  - name: Rates (/rates)
    flow:
      - get:
          url: '/rates'